'''
Текстовый файл 24-360.txt содержит только десятичные цифры и заглавные буквы латинского алфавита.
Определите в прилагаемом файле последовательность из максимального количества идущих подряд одинаковых букв,
начинающуюся и заканчивающуюся чётной цифрой, не содержащую других букв, кроме повторяющихся,
не содержащую цифр, кроме первой и последней.
В ответе запишите число – количество символов в найденной последовательности.
'''
with open('24data/24-360.txt') as f:
    s = f.read()

prev_even_pos = len(s)
max_len = 0
for i in range(len(s)):
    if s[i] in '02468':
        if len(set(s[prev_even_pos + 1:i])) == 1 and s[i - 1].isalpha():
            max_len = max(max_len, i - prev_even_pos + 1)
        prev_even_pos = i
print(max_len)
