'''На числовой прямой даны два отрезка: P = [12, 28] и Q = [15, 30]. Отрезок A таков, что формула
 ((x in P) → (x in A)) /\ ((x not in Q) \/ (x in A))
истинна при любом значении переменной x. Определите наименьшую возможную длину отрезка A.
'''

def f(x, a):
    return (12 <= x <= 28) <= (x in a) and (not 15 <= x <= 30 or x in a)


a = []
for x in range(1, 100):
    if not f(x, a):
        a.append(x)
print(a[-1] - a[0])
