'''Определите количество натуральных чисел A таких, что выражение
((x & 7  !=0) -> ((x & A !=0) -> (x & 54 !=0))) -> ((x & 27  =0) /\ (x & A !=0) /\ (x & 7 !=0))
тождественно ложно (то есть принимает значение 0 при любом натуральном значении переменной x)?
'''
f = lambda x, a: ((x & 7 != 0) <= ((x & a != 0) <= (x & 54 != 0))) <= ((x & 27 == 0) and (x & a != 0) and (x & 7 != 0))


def is_false(a: int) -> bool:
    for x in range(1, 1000):
        if f(x, a):
            return False
    return True


count = 0
for a in range(1, 1000):
    count += is_false(a)
print(count)
