'''На числовой прямой даны два отрезка: P = [130, 171] и Q = [150, 185].
Укажите наименьшую возможную длину отрезка A такого, что формула
 (x in P) -> (((x in Q) /\ (x not in A)) -> (x not in P))
истинна при любом значении переменной x.
'''

def f(x, a):
    return (130 <= x <= 171) <= (((150 <= x <= 185) and (x not in a)) <= (not 130 <= x <= 171))


a = []
for x in range(1, 1000):
    if not f(x, a):
        a.append(x)
print(a[-1] - a[0])
