'''На числовой прямой даны два отрезка: P = [8, 16] и Q = [25, 40]. Отрезок A таков, что формула
 ((x in P) \/ (x in Q)) → (x in A)
истинна при любом значении переменной x. Определите наименьшую возможную длину отрезка A.
'''

def f(x, a):
    return ((8 <= x <= 16) or (25 <= x <= 40)) <= (x in a)


a = []
for x in range(1, 100):
    if not f(x, a):
        a.append(x)
print(a[-1] - a[0])
