'''
437)	(ЕГЭ-2023) Операнды арифметического выражения записаны в системе счисления с основанием 23:
7x38596(23) + 14х36(23) + 61x7(23)
В записи чисел переменной x обозначена неизвестная цифра из алфавита 23-ричной системы счисления.
Определите наименьшее значение x, при котором значение данного арифметического выражения кратно 22.
Для найденного значения x вычислите частное от деления значения арифметического выражения на 22 и
укажите его в ответе в десятичной системе счисления. Основание системы счисления указывать не нужно.
'''


for x in range(23):
    n1 = int('7038596', 23) + x * 23**5
    n2 = int('14036', 23) + x * 23**2
    n3 = int('6107', 23) + x * 23
    s = n1 + n2 + n3
    if s % 22 == 0:
        print(s // 22)
        break
